app/views/players/_form.html.erb

SELECT `countries`.* FROM `countries`
---
	<%= f.label :Geographical_affiliation %><br />
    <%= f.select :country_id, options_for_select(Country.all.map {|u| [u.name,u.id]}) %>

SELECT `teams`.* FROM `teams`
---
    <%= f.label :team %><br />
    <%= f.select :team_id, options_for_select([["Unaffiliated", ""]] + (Team.all.map {|u| [u.name,u.id]})) %>

SELECT `races`.* FROM `races`
---
    <%= f.label :race %><br />
    <%= f.select :race_id, options_for_select(Race.all.map {|u| [u.name,u.id]}) %>