app/controllers/countries_controller.rb

SELECT `countries`.* FROM `countries`
---
  def index
    @countries = Country.all

SELECT `countries`.* FROM `countries` WHERE `countries`.`id` = 1 LIMIT 1
---
  def show
    @country = Country.find(params[:id])

SELECT `countries`.* FROM `countries` WHERE `countries`.`id` = 1 LIMIT 1
---
  def edit
    @country = Country.find(params[:id])

INSERT INTO `countries` (`name`, `abbreviation`, `flag_file_name`, `flag_content_type`, `flag_file_size`, `flag_updated_at`, `created_at`, `updated_at`) VALUES ('United States of A', 'USA', 'flag_usa.png', NULL, NULL, NULL, '2011-08-16 22:40:02', '2011-08-16 22:40:02')
---
  def create
    @country = Country.new(params[:country])

    respond_to do |format|
      if @country.save