app/controllers/home_controller.rb

SELECT "players".* FROM "players" WHERE (featured = 't')
---
  def index
    @featured_players = Player.find(:all, :conditions => ["featured = ?", true])