app/controllers/home_controller.rb

  def match_set_up
    @featured_players = Player.find(:all, :conditions => ["featured = ?", true])
---
SELECT `players`.* FROM `players` WHERE (featured = 1)