app/controllers/players_controller.rb

  def index
    @players = Player.all
---
SELECT `players`.* FROM `players`

  def show
    @player = Player.find(params[:id])
---
SELECT `players`.* FROM `players` WHERE `players`.`id` = 1 LIMIT 1

  def edit
    @player = Player.find(params[:id])
---
SELECT `players`.* FROM `players` WHERE `players`.`id` = 1 LIMIT 1

  def create
    @player = Player.new(params[:player])

    respond_to do |format|
      if @player.save
---
INSERT INTO "players" ("english_name", "main_race", "country", "team", "team_shorthand", "featured", "created_at", "updated_at") VALUES ('IdrA', NULL, 'US', 'Evil Geniuses', 'EG', 't', '2011-08-14 01:20:20.752582', '2011-08-14 01:20:20.752582')

  def update
    @player = Player.find(params[:id])

    respond_to do |format|
      if @player.update_attributes(params[:player])
---
SELECT `players`.* FROM `players` WHERE `players`.`id` = 1 LIMIT 1
UPDATE `players` SET `team_id` = NULL, `mini_head_file_name` = 'comsat.png', `action_shot_file_name` = 'protoss.png', `updated_at` = '2011-08-16 23:44:29' WHERE `players`.`id` = 1