app/controllers/races_controller.rb

  def index
    @races = Race.all
---
SELECT `races`.* FROM `races`

  def show
    @race = Race.find(params[:id])
---
SELECT `races`.* FROM `races` WHERE `races`.`id` = 1 LIMIT 1

  def create
    @race = Race.new(params[:race])

    respond_to do |format|
      if @race.save
---
INSERT INTO `races` (`name`, `race_logo_file_name`, `created_at`, `updated_at`) VALUES ('Zerg', 'zerg.png', '2011-08-16 23:27:09', '2011-08-16 23:27:09')