app/controllers/teams_controller.rb

SELECT `teams`.* FROM `teams`
---
  def index
    @teams = Team.all

SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 1 LIMIT 1
---
  def show
    @team = Team.find(params[:id])

INSERT INTO `teams` (`name`, `abbreviation`, `created_at`, `updated_at`) VALUES ('Evil Geniuses', 'EG', '2011-08-16 23:03:34', '2011-08-16 23:03:34')
---
  def create
    @team = Team.new(params[:team])

    respond_to do |format|
      if @team.save